In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
ufo_df = pd.read_csv('dastasets/ufo.csv')

In [3]:
ufo_df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo_df['Time'] = pd.to_datetime(ufo_df['Time'], format='%m/%d/%Y %H:%M')

In [9]:
type(ufo_df['Time'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [10]:
ufo_df['Month'] = ufo_df['Time'].dt.month

In [11]:
def indecember(x):
    if x == 12:
        return 1
    else:
        return 0

In [12]:
ufo_df['IN_December'] = ufo_df['Month'].apply(indecember)

In [13]:
ufo_df.head()

,City,Colors Reported,Shape Reported,State,Time,Month,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,6,0
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,6,0
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,2,0
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,6,0
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,4,0

In [29]:
ufo_df['Time_Diff_From_WW1'] = (ufo_df['Time'] - datetime(1914,7, 28))/ np.timedelta64(1, 'Y')

In [30]:
ufo_df.head()

,City,Colors Reported,Shape Reported,State,Time,Month,IN_December,Time_Diff_From_WW1
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,6,0,15.846778
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,6,0,15.925949
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,2,0,16.554983
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,6,0,16.845087
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,4,0,18.726714